#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
execute if score time cmzy_timer matches ..200 run title @a actionbar ["",{"text":"返回大厅...","color":"yellow","bold":true}]
execute if score time cmzy_timer matches 200.. run tp @a 0 233 0
execute if score time cmzy_timer matches 200.. run gamemode adventure @a
execute if score time cmzy_timer matches 200.. run function cmzy:others/next_level
