#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#知识产权声明 
#GoldenEggs拥有本我的世界内置游戏数据包以及建筑存档地图内所有资料的版权，各分频道权利声明有特殊规定的，从其规定。任何被授权的浏览、复制、打印和传播属于本我的世界内置游戏数据包以及建筑存档地图内的资料必须符合以下条件： 
#• 所有的资料和图象均以获得信息为目的； 
#• 所有的资料和图象均不得用于商业目的； 
#• 所有的资料、图象及其任何部分都必须包括此版权声明； 
#本我的世界内置游戏数据包以及建筑存档地图（www.gold.eggs.com）所有的产品、技术与所有程序均属于GoldenEggs知识产权，在此并未授权。 “GoldenEggs”及相关图形等为GoldenEggs的注册商标。 
#未经GoldenEggs许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用，或通过非常规方式（如：恶意干预GoldenEggs数据）影响GoldenEggs的正常服务，任何人不得擅自以软件程序自动获得GoldenEggs数据。否则，GoldenEggs将依法追究法律责任。
#小门开启动画
########################金蛋工作室##金###金蛋工作室，沉梦之渊数据包。禁止二次创作，禁止盗版。#金蛋工作室，沉##金蛋工作室，沉梦之渊数据包。禁止二次创作，禁止盗版。梦之渊数据##金蛋工作室，沉梦之渊数###金蛋工作室，沉梦之渊数据包。禁止二次创作，禁止盗版。#金蛋工作室，沉梦之渊数据包。禁止二次创作，禁止盗版。据包。禁止二次创作，禁止盗版。包。禁止二次创作，禁止盗版。蛋工作室##金蛋工作室，沉梦之渊数据包。禁止二次创作，禁止盗版。，沉梦之渊数据包。禁止二次创作，禁止盗版##金蛋工作室，沉梦之渊数据包。禁止二次创作，禁止盗版。。，##金蛋工作室，沉梦之渊数据包。禁止二次创作，禁止盗版。沉##金蛋工作室，沉梦之##金蛋工作室，沉梦##金蛋工作室，沉梦之渊数据包。禁止二次创作，禁止盗版。之渊数据包。禁止二次创作，禁止盗版。数据包。禁止二次创作，禁止盗版。梦之##金蛋工作室，沉梦之渊数据包。禁止二次创作，禁止盗版。渊数据包。禁止二次创作，禁止盗版。MAP1
execute if score map cmzy_count matches 1 run function cmzy:map/maps/opensmalldoor/opendoormap1
execute if score map cmzy_count matches 2 run function cmzy:map/maps/opensmalldoor/opendoormap2
execute if score map cmzy_count matches 3 run function cmzy:map/maps/opensmalldoor/opendoormap3
#新手提示
execute if score time cmzy_timer matches 100 run tellraw @a[tag=MengXin] ["\u00a7e[提示] ：[\u00a7l\u00a76小门\u00a7e]，已通电，小门会开启，开放更多场景。"]
execute if score time cmzy_timer matches 300 run tellraw @a[tag=MengXin,tag=normal] ["\u00a7e[提示] ：你需要拾取散落在各处的[\u00a75\u00a7l零件\u00a7e]去修复充能[\u00a76\u00a7l梦境沙漏\u00a7e]\n[\u00a7f\u00a76大门\u00a7e]会因[\u00a76\u00a7l梦境沙漏\u00a7e]充能完毕通电。"]
execute if score time cmzy_timer matches 300 run tellraw @a[tag=MengXin,tag=normal] ["\u00a7e[提示] ：[\u00a7l\u00a76大门\u00a7e]通电后找到并开启逃出它，直至自身胜利游戏结束！。"]
execute if score time cmzy_timer matches 300 run tellraw @a[tag=MengXin,tag=killer_2] ["\u00a7e[提示] ：[\u00a7b\u00a7l逃生者\u00a7e]会寻找散落在各地的[\u00a75\u00a7l零件\u00a7e]去修复充能[\u00a76\u00a7l梦境沙漏\u00a7e]\n在[\u00a76\u00a7l梦境沙漏\u00a7e]充能完毕后[\u00a7f\u00a76大门\u00a7e]会通电，不能让他们逃出[\u00a7f\u00a76大门\u00a7e]！\n阻止击败一切有利于[\u00a7b\u00a7l逃生者\u00a7e]的物件事件！"]
